Repository: ClusterM/wg-obfuscator
Catalog: openwrt-luci/po/*/wg-obfuscator.po
Languages: ru

source: WireGuard Obfuscator Configuration
ru: Настройка WireGuard Obfuscator

source: Configure WireGuard Obfuscator instances to obfuscate WireGuard traffic.
ru: Настройка экземпляров WireGuard Obfuscator для обфускации WireGuard трафика.

source: Instances
ru: Экземпляры

source: Configure individual obfuscator instances. Each instance can have different settings.
ru: Настройка отдельных экземпляров обфускатора. Каждый экземпляр может иметь свои параметры.

source: Add instance
ru: Добавить экземпляр

source: Name
ru: Имя

source: Enable
ru: Включить

source: Enable this instance
ru: Включить этот экземпляр

source: Source Port
ru: Исходящий порт

source: Local port to listen for incoming connections
ru: Локальный порт для входящих соединений

source: Target
ru: Целевой сервер

source: Target server in format host:port
ru: Целевой сервер в формате хост:порт

source: Source Interface
ru: Исходящий интерфейс

source: Interface to bind to (0.0.0.0 for all interfaces)
ru: Интерфейс для привязки (0.0.0.0 для всех интерфейсов)

source: Obfuscation Key
ru: Ключ обфускации

source: Key used for obfuscation (must be the same on both sides)
ru: Ключ для обфускации (должен совпадать на обеих сторонах)

source: Masking Type
ru: Тип маскировки

source: Protocol masking for DPI evasion
ru: Маскировка протокола для обхода DPI

source: None
ru: Нет

source: Auto-detect
ru: Автоопределение

source: Log Level
ru: Уровень логирования

source: Verbosity level for logging
ru: Уровень детализации логов

source: Errors only
ru: Только ошибки

source: Warnings
ru: Предупреждения

source: Info
ru: Информация

source: Debug
ru: Отладка

source: Trace
ru: Трассировка

source: Max Clients
ru: Макс. клиентов

source: Maximum number of concurrent clients
ru: Максимальное количество одновременных клиентов

source: Idle Timeout
ru: Таймаут простоя

source: Idle timeout in seconds
ru: Таймаут простоя в секундах

source: Max Dummy Data
ru: Макс. пустых данных

source: Maximum dummy data length for packets (0-255)
ru: Максимальная длина пустых данных в пакетах (0-255)

source: Firewall Mark
ru: Метка фаервола

source: Firewall mark for packets (0 to disable)
ru: Метка фаервола для пакетов (0 для отключения)

source: Static Bindings
ru: Статические привязки

source: Static bindings for two-way mode. Enter each binding as ip:port:localport, one per line.
ru: Статические привязки для двустороннего режима. Вводите каждую привязку как ip:порт:локальный_порт, по одной на строку.

source: Service Status
ru: Состояние сервиса

source: Running
ru: Работает

source: Stopped
ru: Остановлен

source: Configuration
ru: Конфигурация

source: Exists
ru: Существует

source: Not found
ru: Не найдена

source: Enabled instances
ru: Включено экземпляров

source: Restart Service
ru: Перезапустить сервис

source: Refresh Status
ru: Обновить статус

source: Processing...
ru: Обработка...

source: Action completed successfully
ru: Действие выполнено успешно

source: Action failed
ru: Действие не выполнено

source: Connection error
ru: Ошибка соединения

source: Restart WireGuard Obfuscator service?
ru: Перезапустить сервис WireGuard Obfuscator?

source: Target cannot be empty
ru: Целевой сервер не может быть пустым

source: Invalid format. Expected: host:port (e.g., example.com:51820)
ru: Неверный формат. Ожидается: хост:порт (например, example.com:51820)

source: Host cannot be empty
ru: Хост не может быть пустым

source: Invalid port. Must be between 1 and 65535
ru: Неверный порт. Должен быть от 1 до 65535

source: Invalid format. Expected: ip:port:localport
ru: Неверный формат. Ожидается: ip:порт:локальный_порт

source: Invalid IP address:
ru: Неверный IP адрес:

source: Invalid remote port:
ru: Неверный удалённый порт:

source: Invalid local port:
ru: Неверный локальный порт:
